import 'package:aqark/models1/category.dart';
import 'package:aqark/models1/data.dart';



const Categories_data = [
  Category(
    id: 'c1',
    title: 'عمارات ',
    imageUrl:
    'assets/images/00.jpg',
  ),
  Category(
    id: 'c2',
    title: 'شقق سكنية',
      imageUrl:'assets/images/01.jpg'
  ),
  Category(
    id: 'c3',
    title: 'فلل',
      imageUrl:'assets/images/02.jpg'
  ),
  Category(
    id: 'c4',
    title: 'اراضي زراعية',
    imageUrl:
    'assets/images/03.jpg',
  ),
  Category(
    id: 'c5',
    title: 'منازل حديثة',
      imageUrl:'assets/images/04.jpg'
  ),
  Category(
    id: 'c6',
    title: 'اخرى',
      imageUrl:'assets/images/05.jpg'
  ),
];




const Pass_data = [
  Data(
    id: 'm1',
    title: 'عمارة سكنية داخل مدينة الزهراء',
    categories: [
      'c1',
    ],
    imageUrl:
    'assets/images/006.jpg',
    details: [
      'المساحة :250 متر مربع',
      'مكونة من 4 طوابق ',
      'جهة شرقية غربية مقابلة للشارع العام',
      'تحتوي على ثلاث غرف وصالة وحمامين',
      'متوفر خدمات ',
      'الكهرباء 24ساعة خلايا شمسية '
    ],
    program: [
     'سعر العقار :124,000دولار امريكي',
     'للتواصل مع مالك العقار رقم جوال:059778588'
    ],
    price:24,
    url: 'https://motiv-x.net/tours/19/04/Taurnblick/'
  ),

  Data(
    id: 'm2',
    categories: [
      'c1',
    ],
    title: 'عمارة سكنية في حي النصر',
    imageUrl:
    'assets/images/007.jpg',
  details: [
    'المساحة :480 متر مربع',
    'مكونة من 5 طوابق ',
    'كل طابق مكون من شقتين سكنيتين',
    'جهة شرقية غربية مقابلة للشارع العام',
    'تحتوي على ثلاث غرف وصالة وحمامين',
    'متوفر خدمات ',
    'الكهرباء 24ساعة خلايا شمسية '
    ],
    program: [
      'سعر العقار :180,000 دولار امريكي',
      'للتواصل مع مالك العقار رقم جوال:059996555'
    ],
      price:5,
      url: 'https://farouqashour.000webhostapp.com/ffff/output'

  ),
  Data(
    id: 'm3',
    categories: [
      'c1',
    ],
    title: 'عمارة سكنية في حي الزيتون',
    imageUrl:
    'assets/images/008.jpg',
    details: [
      'المساحة :480 متر مربع',
      'مكونة من 3 طوابق ',
          'مطلة على حديقة تابعة للمنزل',
      'كل طابق مكون من ثلاث شقق ',
      'متوفر خدمات تنظيف'
    ],
    program: [
      'سعر العقار :245,000 دولار امريكي',
      'للتواصل مع شركة العقارات رقم جوال:059658555'
    ],
    price:5,
      url: 'https://motiv-x.net/tours/19/04/Taurnblick/'

  ),
  Data(
    id: 'm4',
    categories: [
      'c2',
      'c1',
    ],
    title: 'عمارة سكنية في حي الرمال',
    imageUrl:
    'assets/images/009.jpg',
    details: [
      'المساحة :340 متر مربع',
      'مكونة من طابقين ',
      'موقع استراتيجي بقرب مستشفى اصدقاء المريض والمحلات التجارية',
      'شقة بمساحة 110متر',
      'شقق للايجار والتمليك',
      'متوفر خدمات مع حارس للعمارة كراج للسيارات '
    ],
    program: [
      'سعر العقار :350,000 دولار امريكي',
      'للتواصل مع شركة العقارات رقم جوال:059785541'
    ],
    price:5,
      url: 'https://motiv-x.net/tours/19/04/Taurnblick/'

  ),
  Data(
    id: 'm5',
    categories: [
      'c2',
    ],
    title: 'شقة بمساحة 200متر',
    imageUrl:
    'assets/images/010.jpg',
    details: [
      'شقة كاملة مقسمة مع اثاث كامل ',
      'الشقة غربية شرقية مطلة على الشارع ',
      'متوفرة كهرباء كاملة مع ماتور كهربائي اشتراك مجهز',
      'تمليك او ايجار للشقة السكنية',
      'امكانية التمليك بعد الايجار بعقد مع الشركة'
    ],
    program: [
      '  سعر العقار :80,000 دولار امريكي للتمليك',
      'سعر العقار للايجار :الف دولار شهريا',
      'للتواصل مع شركة العقارات رقم جوال:059658255'
    ],
    price:5,
      url: 'https://farouqashour.000webhostapp.com/ffff/output/'

  ),



  Data(
    id: 'm6',
    categories: [
      'c2',
    ],
    title: 'شقق فاخرة بمساحة 250متر',
    imageUrl:
    'assets/images/055.jpg',
    details: [
      'شقة فاخرة مقسمة ومجهزة بأثاث كامل ',
      'شقة مطلة على شاطئ البحر ',
      'متوفرة خلايا شمسية للكهرباء',
    ],
    program: [
      'سعر العقار :450,000 دولار امريكي',
      'للتواصل مع مالك العقار رقم جوال:0568877527 '
    ],
    price:5,
      url: 'https://farouqashour.000webhostapp.com/test/output/'

  ),
  Data(
    id: 'm7',
    categories: [
      'c3',
    ],
    title: 'القصر الابيض بمساحة 800متر',
    imageUrl:
    'assets/images/download (1).jpg',
    details: [
    'قصر ملكي مطلي باللون الابيض ',
    'توجد مسبح بطول 8متر',
    'تتواجد حديقة بها اشجار فواكه متنوعة',
    'مجهزة بافخم واغلى الاثاث في المنطقة',
    'عند شرائك للعقار فانت تمتلك سيارة هدية مع العقار'
    ],
    program: [
      'سعر العقار واحد مليون وخمسمئة الف دولار امريكي',
      'للتواصل مع مالك العقار رقم جوال:0568877527 '
    ],
    price:5,
      url: 'https://farouqashour.000webhostapp.com/nnn/output/'

  ),
  Data(
    id: 'm8',
    categories: [
      'c3',
    ],
    title: 'قصر بمساحة 500متر ',
    imageUrl:
    'assets/images/download (2).jpg',
    details: [
      'قصر غير مجهز بالكامل ',
      'تستطيع التحكم بالقصر عن طريق الانظمة الذكية ',
      'الامان عالي لانه مجهز بجهاز انذار وحرائق لاي طارئ',
      'القصر يضمن كراج خاص وحديقة واسعة واماكن للجلوس والاسترخاء'
    ],
    program: [
     'سعر العقار :800,000 دولار امريكي',
     'للتواصل مع شركة العقارات على الرقم:0569998755'
    ],
    price:5,
      url: 'https://farouqashour.000webhostapp.com/test/output/'
  ),
  Data(
    id: 'm9',
    categories: [
      'c3',
    ],
    title: 'قصر الريان بميزات تكنولوجية',
    imageUrl:
    'assets/images/download.jpg',
    details: [
      'مساحة القصر 650متر مربع',
      'قصر بديكورات عصرية وتكنولوجيا المستقبل',
      'كراج خاص للقصر',
      'حرس للقصر وطباخين ومنظقين مجهزين لخدمة صاحب العقار'
    ],
    program: [
      'سعر العقار :650,000 دولار امريكي',
      'للتواصل مع شركة العقارات على الرقم:059558759'
    ],
    price:5,
      url: 'https://farouqashour.000webhostapp.com/ffff/output/'
  ),
  Data(
    id: 'm10',
    categories: [
      'c4',
    ],
    title: 'ارض زراعية بمساحة 1500متر',
    imageUrl:
    'assets/images/003.jpg',
    details: [
      'الارض مطلة على الشارع العام',
      'الارض مسيجة كاملة',
      'يوجد بالارض غرفة صغيرة لحراستها'
    ],
    program: [
      'سعر المتر 1500دينار اردني ',
      'للتواصل مع شركة العقارات على الرقم:059558759'
    ],
    price:5,
      url: 'https://farouqashour.000webhostapp.com/nnn/output/'
  ),
  Data(
    id: 'm11',
    categories: [
      'c4',
    ],
    title: 'ارض زراعية على حدود القطاع ',
    imageUrl:
    'assets/images/03.jpg',
    details: [
      'ارض زراعية بها جميع الخضروات مزروعة ومجهزة',
      'يوجد بداخلها غرفة مبنية للحارس وكلب حراسة ',
      'يوجد ألاات زراعية '
    ],
    program: [
    'متر الارض الزراعي 900دينار اردني',
    'للتواصل مع صاحب الارض الزراعية رقم الهاتف:059778587'
    ],
    price:5,
      url: 'https://farouqashour.000webhostapp.com/test/output/'
  ),
  Data(
    id: 'm12',
    categories: [
      'c4',
    ],
    title: 'ارض الورد بمساحة650متر',
    imageUrl:
    'assets/images/004.jpg',
    details: [
  'ارض ذات منظر جميل باللون الاحمر',
  'صاحب الارض متعاقد مع محلات ورود للتصدير لهم',
  'الارض خاصة لشخص'
    ],
    program: [
      'متر الارض الزراعي 2500دينار اردني',
      'للتواصل مع صاحب الارض الزراعية رقم الهاتف:059778977'
    ],
    price:5,
      url: 'https://farouqashour.000webhostapp.com/nnn/output/'
  ),
  Data(
    id: 'm13',
    categories: [
      'c5',
    ],
    title: 'شقة سكنية بمساحة 200متر',
    imageUrl:
    'assets/images/055.jpg',
    details: [
      'الشقة جاهزة كهربائيا وسباكة',
      'الشقة بها جميع وسائل الراحة والامان',
      'مطلة على ارض زراعية ',
      'اجواء المنطقة هادئة جدا'
    ],
    program: [
      'سعر العقار 70الف دولار امريكي',
      'للتواصل مع صاحب العقار رقم الهاتف:059778977'
    ],
    price:5,
      url: 'https://farouqashour.000webhostapp.com/ffff/output/'
  ),
  Data(
    id: 'm14',
    categories: [
      'c5',
    ],
    title: 'فيلا بمساحة 900متر',
    imageUrl:
    'assets/images/05.jpg',
    details: [
   'فيلا مجهزة لاسعادكم بها جميع مكونات المرح والسعادة',
   'الفيلا مكونة من ثلاث طوابق ',
   'الفيلا مجهزة باحدث واجميل الديكورات العصرية المواكبة وباثاث متنوع',
   'يوجد بداخلها كراج يسع لاكثر من 8سيارات ',
   'يوجد بها ملعب لكرة قدم وملعب لكرة تنس الارضية '
    ],
    program: [
      'سعر الفيلا :950الف دولار امريكي',
      'للتواصل مع شركة العقارات رقم جوال:059778999 '
    ],
    price:5,
      url: 'https://farouqashour.000webhostapp.com/test/output/'
  ),
  Data(
    id: 'm15',
    categories: [
      'c5',
    ],
    title: 'فيلا سكنية باحدث التكنولوجيا ',
    imageUrl:
    'assets/images/04.jpg',
    details: [
      'الفيلا بمساحة دونمين',
      'الفيلا مجهزة بجميع سبل الراحة ',
      'تحتوي على مسبح وجميع الالعاب المناسبة ',
      'تحتوي على ملعب سلة كبير وكرة قدم',
      'تستطيع التحكم بالفيلا عن طريق الانظمة الذكية ',
      'الامان عالي لانه مجهز بجهاز انذار وحرائق لاي طارئ',
      'الفيلا يوجد بها كراج خاص وحديقة واسعة '
    ],
    program: [
      'سعر الفيلا :مليونين دولار امريكي',
      'للتواصل مع شركة العقارات رقم جوال:059778557 '
    ],
    price:5,
      url: 'https://farouqashour.000webhostapp.com/nnn/output/'
  ),
  Data(
    id: 'm16',
    categories: [
      'c6',
    ],
    title: 'فيلا سكنية من الداخل بمساحة200متر',
    imageUrl:
    'assets/images/010.jpg',
    details: [
      ' بها حارس خاص ومكب للنفايات وكراج خاص',
      'بها جميع وسائل الراحة والاستقرار',
      ' مكان الفيلا بجوار مركز شرطة وبالقرب من مستشفى حكومي وسوق تجاري ومدرسة خاصة',
      'الفيلا مجاور لها شاليهات خاصة وبها بوابة لراحة السكان وحمايتهم وامن السكان'
    ],
    program: [
      'سعر الفيلا :250,000 دولار امريكي',
      'للتواصل مع شركة العقارات رقم جوال:059884874 '
    ],
    price:5,
      url: 'https://farouqashour.000webhostapp.com/ffff/output/'
  ),
  Data(
    id: 'm17',
    categories: [
      'c6',
      'c2',
    ],
    title: 'عمارة سكنية 4طوابق مع حواصل',
    imageUrl:
    'assets/images/008.jpg',
    details: [
     'مساحة كل شقة سكنية 200متر مربع',
     ' بها حارس خاص ومكب للنفايات وكراج خاص',
     'بها جميع وسائل الراحة والاستقرار',
     'مكان العمارة بجوار مدرسة وبالقرب من مستشفى حكومي وسوق تجاري'
    ],
    program: [
      'سعر العقار :750,000 دولار امريكي',
      'للتواصل مع شركة العقارات رقم جوال:0594548527 '
    ],
    price:5,
      url: 'https://farouqashour.000webhostapp.com/test/output/'
  ),
];
